In [1]:
import pandas as pd
import numpy as np
print('Версия pandas:', pd.__version__)

Версия pandas: 2.2.3

In [2]:
df = pd.DataFrame({'English': [[78, 85], np.nan, 70, [75, 78]],
                   'French': [[69, 75], np.nan, 69, [73, 80]],
                   'Spanish': [[68, 78], np.nan, 67, [79, 85]]}, index=[1001, 1002, 1003, 1004])
df.index.name='student_id'
df

             English    French   Spanish
student_id
1001        [78, 85]  [69, 75]  [68, 78]
1002             NaN       NaN       NaN
1003              70        69        67
1004        [75, 78]  [73, 80]  [79, 85]

In [3]:
# разделяем скученные данные из одной колонки
# передаем имя нужной колонки
df.explode('English')

           English    French   Spanish
student_id
1001            78  [69, 75]  [68, 78]
1001            85  [69, 75]  [68, 78]
1002           NaN       NaN       NaN
1003            70        69        67
1004            75  [73, 80]  [79, 85]
1004            78  [73, 80]  [79, 85]

In [4]:
# разделяем скученные данные из нескольких колонок
# передаем нужные колонки в списке
df.explode(['English','French','Spanish'])

           English French Spanish
student_id
1001            78     69      68
1001            85     75      78
1002           NaN    NaN     NaN
1003            70     69      67
1004            75     73      79
1004            78     80      85